# SetWallHeights

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Sets the wall heights of an unstyled wall. Will return false for a styled wall.

```pascal
FUNCTION SetWallHeights(
				h               : HANDLE;
				startHtDistance : REAL;
				endHtDistance   : REAL): BOOLEAN;
```

```python
def vs.SetWallHeights(h, startHtDistance, endHtDistance):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|startHtDistance|REAL|   |
|endHtDistance|REAL|   |

## Examples
#### VectorScript ####
```pascal
PROCEDURE Example;
VAR
h :HANDLE;
boo :BOOLEAN;
BEGIN
CallTool(-208);
h := FSActLayer;
boo := SetWallHeights(h, 12, 23);
END;
RUN(Example);
```
#### Python ####
```python

```

```pascal
resultOK := SetWallHeights(h, 1.0, 2.0);
```
```python
result = vs.SetWallHeights(h, 1.0, 2.0)
```

## Version
Availability: from VectorWorks12.0
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls